**Current result**

```bash
  # module.solution.module.redis_caches["r1"].azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-test"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + shard_count                   = 1
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "module"      = "redis_cache"
          + "serviceName" = "testing"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
          + rdb_backup_enabled              = false
        }
    }
```

**Expected result**

```bash
  # module.solution.module.redis_caches["r1"].azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "rg-test"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + shard_count                   = 1
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/rg-spoke/providers/Microsoft.Network/virtualNetworks/vnet-spoke/subnets/snet-redis"
      + tags                          = {
          + "module"      = "redis_cache"
          + "serviceName" = "testing"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
          + rdb_backup_enabled              = false
        }
    }
```